<?php
/**
 * исчисляемые объекты
 * <titles> - наименование числительного в 3 склонениях:
 *          0 = DECLENSION_MANY   - 0 или от 5 и более
 *          1 = DECLENSION_SINGLE - для 1
 *          2 = DECLENSION_FEW    - для чисел 2-4
 * <type> - род исчисляемого
 *          0 = GENDER_NEUTRAL - средний род //оно
 *          1 = GENDER_MALE    - мужской род //миллион
 *          2 = GENDER_FEMALE  - женский род //тысяча
 */
return [
    // склонения исчисляемых:  сто рублей , один рубль, два рубля
    'руб' => ['titles' => ['рублей', 'рубль', 'рубля'], 'type' => 1],        //MALE
    'коп' => ['titles' => ['копеек', 'копейка', 'копейки'], 'type' => 2],    //FEMALE
    'доллар' => ['titles' => ['долларов', 'доллар', 'доллара'], 'type' => 1],//MALE
    'цент' => ['titles' => ['центов', 'цент', 'цента'], 'type' => 1],        //MALE
    'экз' => ['titles' => ['экземпляров', 'экземпляр', 'экземпляра'], 'type' => 1],
    'лст' => ['titles' => ['листов', 'лист', 'листа'], 'type' => 1],
    'гр' => ['titles' => ['граммов', 'грамм', 'грамма'], 'type' => 1],
    'кг' => ['titles' => ['килограммов', 'килограмм', 'килограмма'], 'type' => 1],
    'т' => ['titles' => ['тон', 'тонна', 'тонны'], 'type' => 2],
    'копия' => ['titles' => ['копий', 'копия', 'копии'], 'type' => 2],
    'серт' => ['titles' => ['сертфикатов', 'сертфикат', 'сертфиката'], 'type' => 1],
    'ресурс' => ['titles' => ['ресурсов', 'ресурс', 'ресурса'], 'type' => 1],
];