<?php
/**
 * наименования чисел
 * 
 * <titles> - наименование числа в 3 склонениях:
 *  если меньше 3, то последнее из списка
 *  в зависимости от рода исчисляемого
 *          0 = GENDER_NEUTRAL - средний род 
 *          1 = GENDER_MALE    - мужской род
 *          2 = GENDER_FEMALE  - женский род
 * <type> - склонение исчисляемого, по умолчанию 0
 *          0 = DECLENSION_MANY   - 0 или от 5 и более
 *          1 = DECLENSION_SINGLE - для 1
 *          2 = DECLENSION_FEW    - для чисел 2-4
 */
return [
    // числа склоняются по родам:  одно Окно, один Кол, одна Колоша
    0  => ['titles' => ['ноль']],
    1  => ['titles' => ['одно', 'один', 'одна'], 'type' => 1],
    2  => ['titles' => ['два', 'два', 'две', ], 'type' => 2],
    3  => ['titles' => ['три'], 'type' => 2],
    4  => ['titles' => ['четыре'], 'type' => 2],
    5  => ['titles' => ['пять']],
    6  => ['titles' => ['шесть']],
    7  => ['titles' => ['семь']],
    8  => ['titles' => ['восемь']],
    9  => ['titles' => ['девять']],
    10 => ['titles' => ['десять']],
    11 => ['titles' => ['одинадцать']],
    12 => ['titles' => ['двенадцать']],
    13 => ['titles' => ['тринадцать']],
    14 => ['titles' => ['четырнадцать']],
    15 => ['titles' => ['пятнадцать']],
    16 => ['titles' => ['шестьнадцать']],
    17 => ['titles' => ['семьнадцать']],
    18 => ['titles' => ['восемьнадцать']],
    19 => ['titles' => ['девятьнадцать']],
    20 => ['titles' => ['двадцать']],
    30 => ['titles' => ['тридцать']],
    40 => ['titles' => ['сорок']],
    50 => ['titles' => ['пятьдесят']],
    60 => ['titles' => ['шестьдесят']],
    70 => ['titles' => ['семьдесят']],
    80 => ['titles' => ['восемьдесят']],
    90 => ['titles' => ['девяносто']],
    100=> ['titles' => ['сто']],
    200=> ['titles' => ['двести']],
    300=> ['titles' => ['триста']],
    400=> ['titles' => ['четыреста']],
    500=> ['titles' => ['пятьсот']],
    600=> ['titles' => ['шестьсот']],
    700=> ['titles' => ['семьсот']],
    800=> ['titles' => ['восемьсот']],
    900=> ['titles' => ['девятьсот']],
];